#### StairsEndConnectionType Enumeration

---

|  |
| --- |
| See Also |

The join style between a run and landing.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum StairsEndConnectionType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StairsEndConnectionType ``` |

| Visual C++ |
| --- |
| ``` public enum class StairsEndConnectionType ``` |

# Members

| Member name | Description |
| --- | --- |
| StraightCut | The run and landing are joined by a straight cut. |
| Notch | The run and landing are joined by a notch. |

# See Also

Autodesk.Revit.DB.Architecture Namespace